**1. melt() : (Wide to long)**- The melt() method is used to unpivot the DataFrame from wide format
to long format. In otherwords we can say, it takes columns that represent the different variable and combine
them into key  value pairs (i.e long form of

data).

**When to use melt()?**
-> When you have a DataFrame where is each row represents observation and each column represents variable
or measurements and you want to resahpe data into longer formats for easier analyasis or visualization.

**Syntax**

df.melt(id_vars=None, value_vars=None, var_name=None, value_name=None, col_level=None)

**Parameters:**

**id_vars** : The columns that you want to keep fixed (these columns will remain
as identifiers).

**value_vars** : The columns you want to unpivot (the ones you want to “melt”
into a single column).

**var_name** : The name to use for the new column that will contain the names of
the melted columns (default is 'variable' ).

**value_name** : The name to use for the new column that will contain the values
from the melted columns (default is 'value' ).

**col_level** : Used for multi-level column DataFrames.

In [1]:
import pandas as pd

In [3]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Math': [85, 78, 92],
'Science': [90, 82, 89],
'English': [88, 85, 94]
}
df = pd.DataFrame(data)
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [7]:
# Melting Data
df.melt(id_vars=['Name'], value_vars=['Math', 'Science', 'English'], var_name="Subject", value_name="Scores")

      Name  Subject  Scores
0    Alice     Math      85
1      Bob     Math      78
2  Charlie     Math      92
3    Alice  Science      90
4      Bob  Science      82
5  Charlie  Science      89
6    Alice  English      88
7      Bob  English      85
8  Charlie  English      94

**2. pivot()** - The pivot() function is  use to reshape the data, specifically to turn long format
data into wide format data. It is reverse of the melt() function.

In [32]:
df2 = df.melt(id_vars=['Name'], value_vars=['Math', 'Science', 'English'], var_name="Subject", value_name="Scores")
df2

      Name  Subject  Scores
0    Alice     Math      85
1      Bob     Math      78
2  Charlie     Math      92
3    Alice  Science      90
4      Bob  Science      82
5  Charlie  Science      89
6    Alice  English      88
7      Bob  English      85
8  Charlie  English      94

In [36]:
df2.pivot(index='Name', columns='Subject', values='Scores')

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89